{"content": "Gift Cards\n\nPrivate Dining\n\nCatering\n\nFAQs\n\nCareers\n\nContact\n\nFacebook\n\nTwitter\n\nYouTube\n\nLocations\n\nMenu\n\nDrinks\n\nOrder Online\n\nTo-Go\n\nOur Story\n\n\n\nThe Story of Pappas\nFrench Quarter Flavors\nOur Passion for Seafood\n\nJoin Our E-Club\n\n\n\nGet Great Offers & Specials\n\nAustin I-35 at 290(512) 452-9363\n\nMenus\n\nMap\n\nMore Info\n\n\n\nChange Location\n\nAppetizers\n\nSoups & Salads\n\nCajun Specialties\n\nChef Selections\n\nFried Seafood\n\nSteak & Lobster\n\nDesserts\n\nWe've selected a few of our favorite fresh, delicious menu items to give you a taste of what you’ll find at Pappadeaux. See what's cooking where you are, including specials, features, and prices, by searching for a Pappadeaux near you!\n\nAustin I-35 at 290\n\nView menus for a different location\n\nTraditional Shrimp Cocktail\n\nWith cocktail sauce\n\nFried Calamari\n\nArtichoke hearts, spicy marinara sauce\n\nCrispy Alligator\n\nFresh cut potato sticks & Creole dipping sauce\n\nChef Selection Oysters\n\nOn the Half Shell\n\nOven Baked Crab Cake\n\nJumbo lump crab, lemon caper butter\n\nMozzarella Cheese Bites\n\nSpicy marinara sauce\n\nCrab & Spinach Dip\n\nParmesan crostini\n\nShrimp & Crawfish Fondeaux\n\nGarlic bread\n\nBoudin\n\nCajun sausage stuffed with dirty rice, served with white rice\n\n\"Louisiana\" Gumbo\n\nShrimp | Crab | Seafood | Andouille Sausage & Seafood\n\nPappadeaux House Salad\n\nCroutons, baby tomatoes, red onion, honey\nbacon, aged cheddar & choice of dressing\n\nClassic Caesar\n\nCroutons, Parmesan cheese & Caesar dressing\n\nPappas Greek Salad\n\nFresh vegetables, imported kalamata olives,\ncapers, pepperoncini peppers, oregano &\nfeta cheese in Pappas Greek dressing, Prepared Table-Side\n\nChopped Salad\n\nTomatoes, egg, honey bacon, red onion, avocado,\ncheddar & Jack cheese in a creamy vinaigrette with Fried Chicken Tenderloins, Fried Crawfish, or Grilled Salmon*\n\nCaesar Salad\n\nHerb croutons, Parmesan cheese & Caesar dressing\nGrilled Chicken Tenderloins, Grilled Shrimp, or Blackened Salmon*\n\nSeafood Cobb Salad\n\nHoney bacon, red onion, bleu cheese, egg, avocado,\ntomatoes, house vinaigrette & creamy vinaigrette\nShrimp or Shrimp & Jumbo Lump Crab\n\nCrawfish Étouffée\n\nWhite rice\n\nShrimp Étouffée\n\nWhite rice\n\nCrawfish Platter\n\nFried crawfish & crawfish etouffee\n\nBlackened Catfish\n\nRed beans & rice\n\nPasta Mardi Gras\n\nLinguine, crawfish, andouille sausage, cremini mushrooms, marinara cream sauce, jumbo grilled shrimp\n\nJumbo Shrimp Brochette\n\nGrilled bacon wrapped shrimp filled with Monterey Jack cheese & a sliver of jalapeño, dirty rice\n\nGrilled Half Chicken\n\nMarinated in garlic & rosemary, broccolini\n\nGrilled Tilapia & Lump Crab\n\nSeared shrimp, lemon butter, green beans with toasted almonds\n\nWild-Caught Grouper & Jumbo Crab\n\nSpicy seared grouper, shrimp, jumbo lump crab, lemon butter, spaghetti squash\n\nAmerican Red Snapper & Shrimp\n\nGrilled snapper, seared shrimp, lemon butter, Italian barley salad with toasted almonds\n\nShrimp, Scallop & Jumbo Lump Crab Tagliatelle Pasta\n\nSeared shrimp, scallops, jumbo lump crab, spinach, tomatoes, tagliatelle pasta, white wine cream sauce\n\nRainbow Trout & Shrimp\n\nPan-grilled trout, seared shrimp, sautéed spinach, lemon butter\n\nMississippi Catfish Opelousas\n\nBlackened catfish, oysters, shrimp, jumbo lump crab, lemon garlic butter sauce, dirty rice\n\nCrispy Atlantic Salmon* & Scallop\n\nSeared shrimp, scallop, lemon butter, sautéed spinach\n\nWild-Caught Mahi Alexander\n\nBlackened mahi, shrimp, scallops, crawfish, white wine cream sauce, dirty rice\n\nGiant Shrimp & Grits\n\nGrilled shrimp, sautéed spinach, creamy cheese grits with andouille & sweet corn in a spicy Creole butter\n\nTexas Redfish Pontchartrain\n\nPan-grilled redfish, lump crab, shrimp, brown-butter wine sauce, dirty rice\n\nFried Shrimp\n\nShrimp & Cajun Chicken Tenderloins\n\nFried Oysters\n\nStuffed Crab\n\nCajun Chicken Tenderloins\n\nStuffed Shrimp\n\nCatfish Fillets\n\nCrawfish Dinner\n\nShrimp & Catfish Fillets\n\nSoft Shell Crab\n\nSampler Platter\n\nFried catfish fillet, shrimp, crawfish & chicken tenderloins\n\nSeafood Platter\n\nTwo fried catfish fillets, shrimp, oysters, stuffed shrimp & stuffed crab\n\nPappadeaux Platter\n\nOur seafood platter with extra fried shrimp & crawfish\n\nFilet Mignon\n\nBaked potato, broccolini\n\nFilet Mignon Oscar\n\nJumbo lump crab, light wine cream sauce, baked potato, sautéed spinach\n\nAged Beef Ribeye\n\nBaked potato\n\nGrilled Caribbean Lobster Tail\n\nBaked potato, broccolini\n\nLive Maine Lobster\n\nSteamed lobster by the pound, melted butter, linguine pasta\n\nVanilla Cheesecake\n\nFresh strawberries\n\nKey Lime Pie\n\nGraham cracker pecan crust\n\nTurtle Fudge Brownie\n\nWith pecans & vanilla ice cream\n\nCreme Brûlée\n\nFresh berries, whipped cream\n\nFried Calamari\n\nArtichoke hearts, spicy marinara sauce\n\nCrispy Alligator\n\nFresh cut potato sticks & Creole dipping sauce\n\nOven Baked Crab Cake\n\nJumbo lump crab, lemon caper butter\n\nMozzarella Cheese Bites\n\nSpicy marinara sauce\n\nCrab & Spinach Dip\n\nParmesan crostini\n\nShrimp & Crawfish Fondeaux\n\nGarlic bread\n\n\"Louisiana\" Gumbo\n\nShrimp | Crab | Seafood | Andouille Sausage & Seafood\n\nPappadeaux House Salad\n\nCroutons, baby tomatoes, red onion, honey\nbacon, aged cheddar & choice of dressing\n\nChopped Salad\n\nTomatoes, egg, honey bacon, red onion, avocado,\ncheddar & Jack cheese in a creamy vinaigrette with Fried Chicken Tenderloins, Fried Crawfish, or Grilled Salmon*\n\nCrawfish Étouffée\n\nWhite rice\n\nBlackened Catfish\n\nRed beans & rice\n\nPasta Mardi Gras\n\nLinguine, crawfish, andouille sausage, cremini mushrooms, marinara cream sauce, jumbo grilled shrimp\n\nWild-Caught Mahi Alexander\n\nBlackened mahi, shrimp, scallops, crawfish, white wine cream sauce, dirty rice\n\nGiant Shrimp & Grits\n\nGrilled shrimp, sautéed spinach, creamy cheese grits with andouille & sweet corn in a spicy Creole butter\n\nTexas Redfish Pontchartrain\n\nPan-grilled redfish, lump crab, shrimp, brown-butter wine sauce, dirty rice\n\nFried Shrimp\n\nFilet Mignon\n\nBaked potato, broccolini\n\nVanilla Cheesecake\n\nFresh strawberries\n\nKey Lime Pie\n\nGraham cracker pecan crust\n\nTurtle Fudge Brownie\n\nWith pecans & vanilla ice cream\n\nCreme Brûlée\n\nFresh berries, whipped cream\n\nAlaskan King Crab\n\nThis crustacean delicacy can be found in the Barents Sea, the Bering Sea, and in the\npristine waters off the Alaska coast. One of the most sought-after crab species,\nindividuals can grow to be quite large, making them popular and easy to eat. Order\nup a Pappadeaux favorite, Alaskan King Crab Legs with a side of pasta, and you’ll\nsee exactly what we mean.\n\nView More Seasonal Options\n\nHard-Shell Crab\n\nSince the 1920s, fishermen have used crabpots to trap these crustaceans. The pots are designed only to catch larger animals, allowing the younger crab to escape and continue to grow. We prepare this seafood delicacy by boiling or steaming. Once the claws are removed, you can get at the delicate crabmeat by cracking the hard shell or carapace. The claws contain denser meat, which can be accessed by cracking them with a nutcracker. One specialty of French Quarter cuisine is stuffed crab, where the meat is removed, mixed with aromatics such as onion, bell pepper, celery and such, and then served on the shell, au gratin. Easy to eat; easy to love.\n\nView More Seasonal Options\n\nSoftshell Crab\n\nThis is a Gulf specialty you won’t want to miss. For generations, Gulf coast fishermen have caught this delicacy in the bays and shallow waters at exactly the right time, just when the crab have molted their shells. The prime season for Gulf blue crab generally runs from April until September, although the crab can be caught all year round. Every morning, the crab boats seek out the best crab grounds and lay out their trotlines and snoods. When they return and run their trotlines, they can harvest the precious catch. Softshell crab is generally prepared pan-grilled or sautéed, but it’s also delicious in a simple sandwich with a fresh tomato.\n\nView More Seasonal Options\n\nCrawfish\n\nResembling a small lobster, this crustacean is a classic ingredient in Cajun cuisine, used in soups, bisques and étouffées, or boiled whole with vegetables. Crawfish fishing in Louisiana goes back for generations. The fishermen set traps designed to catch crawfish only of sufficient size. There are also large commercial crawfish farms, where the crustaceans can grow under strictly controlled environmental conditions. This is important, since the quality of the crawfish is largely determined by environmental factors such as water temperature, population density, vegetation, and even the phase of the moon! The most edible part of the crawfish is the tail, though the claws also contain meat well worth digging for. Order a big plate of steaming-hot mudbugs for the whole table to share and get cracking!\n\nView More Seasonal Options\n\nFlounder\n\nThe delicate Gulf Flounder is a flatfish that lives inshore, primarily on sandy-bottomed bays or creeks. After it hatches, one of its eyes migrates over so both eyes are on the left side of the fish. This allows it to lie flat and wait for food to come within reach, when it pounces on its prey. Flounder can be caught with a line, but more commonly in commercial fishing, it is netted. It can be baked, sautéed whole or filleted and is often complemented by a delicate butter or lemon sauce. It has a subtle, sophisticated flavor that makes it a gourmet favorite. For a special Pappadeaux treat, ask for our Parmesan Crusted Flounder!\n\nView More Seasonal Options\n\nGrouper\n\nWith its large mouth and thick body, the grouper may not be the prettiest fish in the sea, but it’s a cousin to the sea bass, and a very popular choice among chefs and fish-lovers alike. While grouper can be found all over the world, chefs agree that the Gulf grouper is the best. Some years ago, the Gulf grouper was at risk of being fished out of existence. Today, it is harvested according to a catch share program that ensures a healthy, sustainable population. Individual grouper can grow to be up to 200 lbs. With its firm, lean, white flesh, the Gulf grouper is regarded as being a particularly delicious and versatile fish. Ask your server about the Grouper with Alexander Sauce. C’est tres bien!\n\nView More Seasonal Options\n\nCaribbean Lobster\n\nThis spiny lobster can be found all through the Caribbean and the Gulf. These creatures like to hide in reefs, natural or artificial, and in mangrove swamps. Commercially, they are generally caught using traps. The prime lobster season in the U.S. stretches from August to April. Unlike its Maine cousin, the Caribbean lobster has no claws, so the edible flesh is all in the body and tail, which is often grilled. Opinions differ as to whether Caribbean or Maine lobster taste better. Why not conduct your own delicious investigation at a Pappadeaux near you?\n\nView More Seasonal Options\n\nMaine Lobster\n\nKnown as the king of the crustaceans, lobster is an important New England seafood delicacy, and harvesting it is controlled by strict, detailed regulation. Only lobster larger than a legal minimum can be taken, and no lobster at all can be caught between June and October. Only conventional lobster traps from boats can be used, and even commercial fishermen are limited to a maximum number of traps. Fishermen are forbidden from taking any lobster whose shell is longer than five inches, and female lobsters must be V-marked and returned to the sea. There are strict penalties for any deviation from these rules, which are an essential part of maintaining a sustainable lobster population. This prized culinary delicacy is used in bisques, soups, boils, salads and many other applications. It is probably at its most delicious simply boiled or steamed and eaten dipped in clarified butter. This brings out the sweet flavor that is the hallmark of this magnificent seafood.\n\nView More Seasonal Options\n\nSpanish Mackerel\n\nThis tasty fish is rapidly gaining popularity in fine dining circles. The fish is found in the Atlantic, but migrates to the Gulf every spring. In order to prevent over-fishing, Federal regulations were introduced that limit where and how much the mackerel can be harvested. In the thirty years since they were introduced, these measures have resulted in a healthy and sustainable mackerel population. The meat of the mackerel is dark and delicious. It is one of the most potent sources of healthy Omega-3 fatty acids. Spanish Mackerel can be baked, broiled, steamed, smoked, poached or fried and enjoyed in combination with other seafood, for example shrimp or lobster.\n\nView More Seasonal Options\n\nMahi Mahi\n\nHarvested from the clear waters off the coast of Costa Rica, this fish is renowned for its rich, buttery flavor. It can be prepared in many ways, including baked, grilled, broiled, fried or poached. One Pappadeaux favorite you shouldn’t miss is our Blackened Mahi Alexander with shrimp and crawfish, topped with a white wine cream sauce. It’s a mouthwatering celebration of the taste of New Orleans.\n\nView More Seasonal Options\n\nBlue Point Oysters\n\nThis type of oyster is found in the Atlantic and generally served on the half-shell. Named for the Long Island town of Blue Point, where they were first gathered, this oyster can be found today along much of the New England coast. Blue Points have a firm consistency and a bright flavor, with a much-appreciated sweet and briny aftertaste.\n\nView More Seasonal Options\n\nGulf Coast Oysters\n\nThis Gulf specialty is generally slightly sweeter than its Northern cousin. Highly prized as a winter delicacy, the gulf oyster is the perfect size to be swallowed whole. Oysters can be wild-caught by dredging or farmed. The latter method allows close monitoring of key environmental factors such as water temperature and quality. Enjoy a half dozen or a dozen with a little lemon juice or a dash of hot sauce. If you want to experience a French Quarter classic, ask your waiter about the Oysters Baton Rouge. Magnifique!\n\nView More Seasonal Options\n\nGulf Coast Redfish\n\nThis fish is also known as Red Drum or simply as Texas Red. Spawned in the bays around the Gulf, the fish moves out into deeper waters as it matures. Adult fish generally stay in deep water, but can sometimes, particularly during storms, be found closer to beaches or in tidal creeks. This versatile Gulf delicacy can be enjoyed baked, grilled, sautéed or blackened. At Pappadeaux, we also serve it with Maine lobster and risotto for a special treat. It’s a Lonestar classic with a French Quarter twist!\n\nView More Seasonal Options\n\nAtlantic Salmon\n\nSometimes known as the King of Fish, the Atlantic salmon lends itself to a broad range of preparations. Our seafood chefs prepare many succulent salmon dishes, including such Pappadeaux favorites as Cedar Plank Salmon, Crispy Salmon with Jumbo Crab & Shrimp, or Atlantic Salmon Yvette with shrimp and crawfish. Talk about delicious French Quarter flavors!\n\nView More Seasonal Options\n\nGulf Brown Shrimp\n\nThis Gulf shrimp has a brown shell and a slightly firmer texture than its cousin, the White Shrimp. When cooked, the shell turns a coral color. Gulf shrimp are a delicacy you simply can’t deny yourself when they’re in season.\n\nView More Seasonal Options\n\nGulf Pink Shrimp\n\nGulf shrimp are among the best in the world, and the Gulf Pink is at the top of the flavor chart. Pink in its raw state, this shrimp develops a deeper red hue when cooked.\n\nView More Seasonal Options\n\nGulf White Shrimp\n\nOften preferred by chefs, the Gulf White Shrimp has a sweet flavor and a toothsome texture. This shrimp also turns pink when cooked.\n\nView More Seasonal Options\n\nLane Snapper\n\nSnapper is an offshore fish, often found close to the sea bottom, sometimes as deep as 300 ft. They often congregate around natural or artificial reefs such as ledges or wrecks. As they mature, these fish become more territorial and can be found in deeper waters. This fish is definitely trending on the culinary front, and for good reason. With a sweet, mild flavor that pairs well with delicate sauces, it can be enjoyed grilled, baked or sautéed. Red snapper is a very popular delicacy. For a real New Orleans classic, ask your server about our famous Red Snapper Ponchartrain.\n\nView More Seasonal Options\n\nCatfish\n\nCatfish is especially popular in the American south where it has long been a staple, whether fried or blackened. Our fresh catfish is farm-raised right here in the U.S. and can be enjoyed in New Orleans classics like Blackened Catfish Opelousas and Catfish with Red Beans & Rice.\n\nView More Seasonal Options\n\nAlaskan Halibut\n\nHalibut is renowned for its delicate sweet flavor, snow-white color and firm flaky meat. It is an excellent source of high-quality protein and minerals. Halibut on the menu at Pappadeaux is caught fresh in Alaskan waters and is seasonally available. Try our Alaskan Halibut Piccata next time you’re in!\n\nView More Seasonal Options\n\nMussels\n\nKnown for their soft texture and sweet flavor, mussels can be found in delicacies all over the world, from Turkey to the Netherlands to Spain to the US. At Pappadeaux you can enjoy our delicious mussels on their own, steamed in white wine and lemon, or paired with our amazing Maine Lobster.\n\nView More Seasonal Options\n\nAlligator\n\nAlligator has been playing a starring role in New Orleans cuisine for decades, and that tradition continues at Pappadeaux. This cold-blooded Louisiana native can weigh up to 790 lbs and 14 feet long. The largest alligator on record measured an impressive 19.2 feet! Our gators are farm-raised, which makes the meat extra tender. Alligator meat is extremely versatile, gracing tables in the form of sausage, dropped into a gumbo or jambalaya, or fried. Fried is just how you'll find it at Pappadeaux, served with Creole dipping sauce.\n\nView More Seasonal Options\n\nStep 1: LOOSEN MEAT\n\nWith oyster fork, loosen meat from the shell\n\nStep 2: ADD FLAVOR\n\nAdd a dash of tabasco, lemon or cocktail sauce.\n\nStep 3: TIP HEAD BACK\n\nRaise shell to mouth, tip head and shell back until oyster slides off. Repeat until full.\n\nLearn More in Our French Quarter Flavors\n\nStep 1: PULL OFF THE TAIL\n\nGrasp crawfish head in one hand, tail in the other. Twist and pull off the tail.\n\nStep 2: PEEL OFF RINGS\n\nPeel off first two rings of the shell from the tail.\n\nStep 3: PINCH END OF TAIL\n\nPinch the end of the tail, pull meat out.\n\nLearn More in Our French Quarter Flavors\n\nStep 1: SEPARATE TAIL\n\nAfter breaking off the claws, Tightly grasp lobster, twist to separate tail from the back.\n\nStep 2: BREAK'EM OFF\n\nBreak off small flippers at the end of the tail.\n\nStep 3: PUSH IT OUT\n\nPush the tail meat out intact through the other end.\n\nLearn More in Our French Quarter Flavors\n\nMenus\n\nPrivate Dining\n\nLocations\n\nJoin Our eClub\n\nDrinks\n\nCatering\n\nTo-Go\n\nFAQs\n\nOur Story\n\nCareers\n\nGift Cards\n\nContact\n\nPappasito's Cantina\n\nPappas Bros. Steakhouse\n\nPappas Seafood House\n\nPappas Bar-B-Q\n\nPappas Burger\n\nYia Yia Mary's Pappas Mediterranean Kitchen\n\nDot Coffee Shop\n\nPappas Delta BluesSmokehouse\n\nPappas Catering\n\nPappas Delivery\n\nPappas.com\n\nTerms of Use\n\nPrivacy Policy\n\nPurchase\n\nBalance Inquiry\n\nGift Card FAQs\n\n© 2023 PRI"}