[
  {
    "username": "Tracey Z.",
    "review": "Lovely little ramen spot! They have lots of appetizer options but ramen wise they have only 4 which is great because then you don't have decision paralysis and you can guarantee that all 4 are going to be good. The Just Like Paitan was really tasty. Came with a huge bowl of tempura which I was surprised by but overall it was delicious. Kind of heavy and a super large filling portion. Lots of light and super bright inside. Great service was well!"
  },
  {
    "username": "John K.",
    "review": "We were in a part of town that we don't normally go to and were looking for a place for lunch.  We used Yelp to find something nearby and this place popped up  with good ratings.  I have to say  Yelp was spot on.....The soup was delicious  the service was great  and the restaurant was clean and cute (if a guy is allowed to use \"cute\" describing a restaurant).  Definitely a great choice  and will return if we're back in that area  again."
  },
  {
    "username": "Ellie N.",
    "review": "Sparkling clean restaurants. Modern designs. Friendly and professional staffs. Very reasonable prices. This place falls in the normal price range for ramen restaurants. Takoyaki: fresh and hot Takoyaki. It melts in your mouth with a very light crispy feeling from the first bite. Signature ramen: nice broth. It comes with pork. I highly recommend you to try out this one first if it's your first time having ramen. Ma-yu ramen: more flavorful than signature  but more oily as well."
  },
  {
    "username": "Allison K.",
    "review": "Really cute spot for ramen! The interior was gorgeous and the service was also amazing. We got the Steamies as an appetizer and it was the best dish: crispy on the outside and super juicy/savory on the inside. As for the ramen (I got the Paitan Ramen) the broth was very flavorful and the noodles were cooked perfectly but the egg and chashu were just okay. Besides the broth  I personally think the chashu is the next most important component of ramen and unfortunately  this one wasn't as flavorful compared to other ramen spots I've been to. Same thing goes for the egg- not bad but it could've sat in the marinade a little longer. Overall  I still enjoyed the experience and I love how it's located next to 99 ranch so I can go grocery shopping afterward :)."
  },
  {
    "username": "Mark M.",
    "review": "Man I'm so disappointed in this place. I'm honestly just disappointed by the food bloggers that recommended this place. This is the second 5 star ramen restaurant (with THOUSANDS reviews) I've been to in Austin that's been just so incredibly mediocre. I read about this place from an Asian American food blogger and therefore expected at least decent ramen. I have to say it's almost insulting that the menu calls that piece of deli meat in the bowl \"cha siu.\" The broth was light which is fine  I enjoy a light broth  I also enjoy a deep rich broth. However there was a TON of raw red onion in the ramen and it was so unpleasant to have that taste completely over power the broth. I kept trying to keep it out of my spoon when I would sip but it was so much that it always snuck it's way into my sip. And arugula is pretty benign but I don't think it belonged there either. I ordered the paitain because it was highly recommended by that food blogger and it was their speciality. So.... Yeah. (I mean this blogger said this is their FAVORITE place for ramen). Anyway  the service was good  we were sat quickly  the staff were pretty attentive. The decor was so weird. It's like a Nordstrom dressing room. However this has zero impact on the dining experience for me. It's pretty much 100% about the food. So unfortunately even though the staff are great the meal was not. :/"
  },
  {
    "username": "Phoebe W.",
    "review": "The food here is pretty bad. I give it two stars because the staff were very nice. And we didn't have to wait very long to be seated  order our food  receive our food  and pay. We ordered peach sake  edamame  ma-yu ramen  and paitan ramen. The sake was very sweet and sparkling. The description did not say it would be sparkling. The edamame was coated everywhere in salt. It was like a baked pretzel. Both ramen bowls were ordered with pork chashu. What we got was Hillshire Farms deli meat. I can't believe they think this is acceptable. I'm confused why the ma-yu ramen had red cabbage in it. And the paitan had raw red onions and asparagus in it. Ramen shouldn't be topped with these things. If you wanna do something fusion  I'm all for that. But this didn't even taste good. Again  I give this 2 stars because the service was nice. The atmosphere was a bit odd. But it's not offensive and didn't harm the dining experience."
  },
  {
    "username": "Yuna K.",
    "review": "Wow im honestly impressed by their ramen! I got the one with the black garlic oil and it was honestly delicious (i think much better than ramen tatsuya). What was the highlight was their ramen egg and their pork chashu! It was so different than other ramen places because it was so soft and tender. They also add arugula to their ramen which is interesting. I originally came here for the daiboku opening but it opens wednesday so i will be back to try the new menu!"
  },
  {
    "username": "Lauren P.",
    "review": "Absolutely obsessed with this place! So... I came here for Ramen and lowkey I didn't expect much  and unpopular opinion but I hate Ramen. THIS PLACE THO *hysterical crying* it was perfect and the tokoyaki was to die for  seriously a magical experience. Okay and the ramen  yes and yes. I got a very flavorful spicy chicken ramen  added a broth bomb and it was love at first bite.        I really liked that this place gave an option of choosing chicken or pork broth. It's very nice for the individuals who don't consume pork  like myself.        P.S. This place fills up fast and usually there is a wait but you can also get in the waiting list via online  through their website!"
  },
  {
    "username": "Eric G.",
    "review": "We went here on a Wednesday night for dinner  no wait! Parking is always a bit rough in this area but we got a spot eventually.I got the regular paitan ramen and my partner got the spicy version. Overall we liked it  the portion size was just enough to be full but not stuffed. The broth was very tasty and I really liked the way the pork was cooked. But  lacked a bit in some of the other toppings I'd typically get with ramen.We also ordered a side but they never gave it to us...Overall I'd give it 3.5 stars  I'd probably try out some of the other ramen in town next time I'm craving it The ramen was very tasty  just lacking in substance a bit.Service could be better (forgot a dish we ordered  seemed a little disorganized).Ambiance was nice  modern yet casual  a nice date spot too."
  },
  {
    "username": "Andrew Y.",
    "review": "Went in with low expectations because ramen is Texas is usually overpriced and mediocre but this place turned out to be alright. Still a little pricey but the food had flavor. The ramen wasn't overly salty which is my biggest problem with other ramen shops around the area. The vegan ramen is served with a side of tempura  it was all stuck together in the shape of a ball  we weren't really sure how to eat it so we just ended up taking it to-go. Only other complaint with the vegan ramen is that it needs veggies. The service was very attentive  our waiter stopped by several times to make sure we were having a good experience. Overall  weeks after the experience  the only thing I'm craving from here are the seasoned waffle fries and mayo. They serve Steamies dumplings (best dumplings in ATX) which is the store next to it  nice partnership."
  }
]