[
  {
    "username": "Jim N.",
    "review": "Another 5-star experience at Uchiko this week!  Off the top  complimentary valet parking is awesome  hat tip to the guys out there working in 90+ degree heat.  Easy drop off  easy pick up after dinner!  Wait staff... amazing... Tyler is \"da man\" in the front of the house  \"extended\" happy hours prices a bit because the kitchen was slow.  All service was great  attentive but not overbearing.  Perfect 5-star!  Don't hire more wait staff  clone Tyler!  PS  Hint to sushi lovers on a budget  hit Uchiko for sushi happy hour... stick to that menu  and you walk out totally satisfied  great sushi  at a fraction of the cost!  When will other sushi bars figure that one out?  If they don't  make Uchiko that \"once a month stop\"...!!!We started with soup  asked for miso soup  no longer available  so we had the new mushroom broth soup  several types of tiny mushrooms and tofu  delicious.  In my opinion  a more \"palate crazy\" event than the miso  very  very good!  Followed up with bluefin akami and bincho  both delicious  perfectly prepared  served at the perfect temperature  nothing else needed ... eat and enjoy!  So much for the happy hour menu!  We followed that with orders of hama chili  wonderful presentation and tasted out of this world!  Next followed orders of sake toro nigiri and shime saba.  Great presentation  fantastically fresh  an oh so wonderful!  We then tried the bluefin and soft shell makis (sushi rolls).  Both were amazing blends of flavors and textures  dipping sauces on the side that brought out the deepest and most sublime flavors of the rolls.  We wrapped up with guykan style uni  and one at the table ordered the banana cake dessert  all were fantastic.  A perfect ending to a perfect meal!  Again!!!"
  },
  {
    "username": "Abida H.",
    "review": "We came for happy hour at Uchiko! I've been to Uchi previously which is known for classic more traditional flavors and apparently Uchiko is the bolder child. The experience was great although if I had to pick  Uchi surpasses it I highly recommend sitting at the bar if you want to enjoy the full experience! You can chat with your dedicated chef and your food is made in front of youDRINKS: drinks were surprisingly a let down because I remember loving the ones at Uchi! We ordered the happy hour murasakino cocktail and the umegave recommended by our server. The flavors mentioned such as lemongrass  hibiscus  makrut  just didn't shine through. Instead they were both overpowered by their sweetness HAPPY HOUR SELECTIONS:We started with two maki rolls  the bincho and sake  both had a fabulous combination of flavors. The salmon one came with shishito peppers and a white chili aioli and the tuna one with crispy wontons and a citrusy dipping sauce. We loved them so much we ordered them twice!We moved to the sake crudo topped with melon & fresh Parmesan  quite tastyOTHER MENU SELECTIONS: If you order one thing it has to be the Hama chili. We've had this before at uchi and it's just phenomenal! Yellowtail with citrus flavors and peppers... divine Complimentary from our chef was the madai or red snapper  so fresh and we loved the lemon zest on topYou can't skip chicken karaage  this one was amazing  perfectly crispy! It came with pickled fruit and was a heartier option We also tried the negi tori roll. The roll was pretty basic but I love the fatty fishDESSERT:You must order this out-of-this-world dessert that blew our mind  the jasmine cream topped with cilantro granita. Who would have thought to pair cilantro ice with this  and what a perfect match! A perfectly sweet and refreshing delight. Pro tip if you ask for it gluten free it comes with candied quinoa instead of honey granolaSERVICE:Our chefs were amazing! So friendly and helpful in making our selections. Our dedicated chef and we also chatted with his pal Johnny. They were both fantastic"
  },
  {
    "username": "Jadyn K.",
    "review": "Wow! Visiting from LA for a friend's birthday and we celebrated at Uchiko. This was some of the best sushi I've had! The happy hour menu is the best I've seen for sushi and it isn't just appetizers. The quality of fish is super fresh and isn't fishy. The presentation was amazing and the overall flavors were unique especially the Sake nigiri! I also loved the sauces in the sake maki and p-38 roll! I've never tried this type of trout before but the Sakura masu was amazing!! The Hama chili was also delicious with the orange slices to be eaten with each cut of yellowtail. I absolutely loved each dish I ate here and definitely recommend coming for happy hour daily from 4-6pm.They have valet parking  which was nice!"
  },
  {
    "username": "Loni M.",
    "review": "Uchiko has an amazing reputation and after dining there  I can definitely understand why. The customer service from the parking lot was amazing. While we had to wait a bit for our table  they made up for that by handing out some hors d'oeuvres. We sat at the sushi bar  which I would recommend. You get to see the sushi chefs prepare your food and it's almost a personal experience. Everything we had was amazing. I still dream about the wagyu nigiri. Just melt in your mouth good. The chef was adamant on serving that to me last and I can see why. The dessert was also really good. We had the milk n cereal dessert. The fried milk surprised me and was the highlight of the dish.Definitely check out Uchiko for your next sushi dinner. They also have an amazing happy hour!"
  },
  {
    "username": "Clint S.",
    "review": "We cannot even describe the amazing level of detail and customer service that everyone here provides. We come here to celebrate special occasions  and this place always goes above and beyond. The food is fresh and artful  the atmosphere is beautiful  and the overall experience is always amazing. Thanks to everyone for another memorable anniversary. There are not enough words to thank each and every member of the team for making another celebration so special in every way. And a special thanks to our sushi chef Hayden who is an absolute master of his craft and an outstanding guy. The entire time he was making his creations  he was also listening to the diners' comments and made suggestions for other dishes or creating items for them based on their tastes. That's talent defined as is everything about Uchiko and why we love it and the people so much. And as an added bonus  we saw the the head honcho Tyson Cole talking to some of the other guests.Overall  the level of seamless service and teamwork is beyond belief just like the incredible and creative food  and I'm always amazed by how we always feel so welcome by everyone."
  },
  {
    "username": "Daniel S.",
    "review": "I recently visited Uchiko with some friends who were in town. We were originally planning to go to Uchi for happy hour  but ended up at Uchiko instead. The restaurant had a different vibe than Uchi  with a modern atmosphere that incorporated a lot of wood tones.The happy hour menu was just as good as Uchi's  with some slight differences in the selection. We ordered the ebi shrimp skewers and bincho maki  both of which were excellent. I enjoyed a hot sake and Sapporo light while we looked over the regular menu. The karaage was a standout dish for me  with perfectly cooked fried chicken pieces. We also tried the p-38  a traditional sushi roll that was stellar.The service at Uchiko was just as good as at Uchi. Our server checked in regularly  provided detailed descriptions of each dish  and even split the check between our two parties  which we appreciated. It was great to see that the level of service matched the price  which isn't always the case at trendy restaurants. I will definitely be returning to Uchiko for my next special occasion."
  },
  {
    "username": "Mark C.",
    "review": "You literally can't pick anything bad when you eat here. We never know what to order and basically have the waiter order for us. Always Incredible! Don't skip the desserts as those are even better than the meal  which seems an impossible feat. Not sure how they do it. Go here!"
  },
  {
    "username": "Leah H.",
    "review": "Quality food  service and every day happy hour! They offer free valet parking as well. Pretty dark and can get loud inside. Highly recommend a reservation."
  },
  {
    "username": "Prothit H.",
    "review": "My best friend was visiting from LA and it was my birthday so we had to come to Uchiko! Our server was incredible and even surprised me with a birthday treat! Now on to the food:We started off with the Sake and Bincho Maki They both were delicious and fresh! I really loved the sauce that came with the Bincho.The blue fin tartare was one of my favorites of the night! The duck was also quite delicious. I loved the smoked beet that it came with as it complemented the duck very well! The fennel I felt could've been used better in the dish. The foie Gras Gunkan was absolutely incredible. It was so fatty and rich  it was the perfect bite! We also ordered a lot of the cool tastings  and each dish was so unique in terms of its preparation and highlighted the fish so well. You honestly can't go wrong in Uchiko. Best and most innovative sushi/crudo/tastings in town! (And I guess even in LA when they open later this year!)"
  },
  {
    "username": "Cayla G.",
    "review": "Uchiko is both upscale and relaxed in its ambiance and service. We were seated at the bar towards the front  which was slightly crowded but allowed us plenty of face-time with the waiter who happily elaborated on anything we questioned. The meal was balanced  fresh  and overall outstanding. I love their sister restaurant  but Uchiko has a more modern feel with more snack-sized portions which allow you to sample a wide variety before getting full."
  }
]