[
  {
    "username": "Henry L.",
    "review": "To be honest  I came in highly skeptical and a bit unenthusiastic about takeout high quality sushi  especially at the prices here.  Despite whether or not sushi at an extravagant price is worth it  I will say that the sushi here was very very good.  We ordered an omakase package with 24 pieces.  All the sushi was absolutely delicious and presented beautifully. The pieces that stuck out to me were the bluefin tuna and the sea scallop  as they were both so tender and packed with flavor.  My least favorite was the uni.  I've had very tasty uni in Japan  but the one here had a flavor that wasn't great.  What you get with the omakase is their homemade soy sauce and ponzu  as well as various side dishes including ginger  octopus  some kind of seaweed  and picked vegetables.  In addition to all the sushi  the sides were also delicious and cleaned out.  We also got their strawberry sando and as usual  it was a refreshing and sweet way to end the meal.If your budget can support Choo Sando  I would recommend giving their sushi a try  I was very impressed."
  },
  {
    "username": "Eunice H.",
    "review": "Shout out to the only Japanese sando place in town! That being said... I would give this place a 3.5 stars because I loved the presentation and the fresh ingredients but at the end of the day - a sandwich is a sandwich  and I'm not sure it's worth the price. I decided to round up to 4 stars because of the attention to detail to food and how good the katsu sando was. For a sandwich  these are some pretty darn good sandwiches. Our favorites were the katsu and egg  which were both full of flavor and densely packed with filling. The lobster was disappointingly overpowered by spicy mayo (which could be a good thing for some people) and the fruit sandwich was just ok. For a meal though... I'm not really sure I would return and it's mostly due to the cost. It felt strange paying higher end dining prices for a sandwich - even if it was a delicious  high quality sandwich. I will say portions are very good - I think the average person would be full after a single box of sando. We ordered ahead and picked food up and as this is a grab-n-go place  can't really comment on the service. The shop itself was very neat and cute though  and the display case is just mouth wateringly beautiful. I would like to give them another chance and try their sushi next but still have to recover from the sticker shock. Definitely worth a try if you are craving some Japanese style sandwiches!"
  },
  {
    "username": "Everett T.",
    "review": "Not worth the hype or the money.Wife and I got the pork sando & the strawberry sando. Both were disappointing. Looked like plain white wonderbread  both sandwiches fell apart after the first bite. As in  the bread disintegrated and the ingredients fell out. You can tell there was some care and attention paid to how the sandwiches were put together  especially the strawberry sando  but for nearly $20 a pop  I expected some actual flavor. Apparently the nigiri is pretty good  maybe we'll skip the sandwiches and try that next time."
  },
  {
    "username": "Lauren H.",
    "review": "We are so lucky to have an establishment like this in Austin. They make gourmet Japanese style sandwiches and sushi in to go boxes but you also opt to eat there as well. It's really clean and quaint inside. Great for a casual brunch. They're constantly refreshing their stock throughout the day and everything is made fresh that day. Everything here was so delicious. I always take friends and family from out of town here. It's excellent and the service is impeccable."
  },
  {
    "username": "Joshua M.",
    "review": "Overall score  4.8 out of 5This place is excellentThey're Omakase or their sandwiches are spectacular and even there strawberry whipped cream sandwich is very delightful. I would highly recommend this place"
  },
  {
    "username": "Naol T.",
    "review": "Currently  Choo has very limited hours. Only open 10:30AM - 2:30PM Wed-Sat.In a strip mall with plenty of parking.Shop is cozy but there are a few tables for dine-in. One display case for grab and pay.The sandos here have more filling to bread ratio compared to the sandos we have had at other places in Cali. The variety of flavors at Choo is unparalleled. I've never seen so many options. Normally fruit and kastu are the only choices offered. Recommend the korean fried chicken over the katsu here. The katsu patty was pretty dense. Fruit and Ebi sandos were delicious.Japanese sando places are pretty rare so pay them a visit. This is Austin's first! They also have really nice looking sushi boxes that we'll have to try next time."
  },
  {
    "username": "Eric B.",
    "review": "I mixed this up with Sandoitchi.  Sorry.  I'll have to try here next.  Update:  we did stop by to get sandwhiches to bring in the new year.  The fish katsu was the best!  The egg salad was a little thick to bite into but good...could have used a little more seasoning  but loved the egg halves embedded in each half--I love the soft bread.  We'll be back to try more."
  },
  {
    "username": "Tracey J.",
    "review": "I was so excited to try this place as I've been meaning to check it out for months now. It's a little shop with a few spots for indoor dining but has a setup mostly intended for take-out orders. Since the hype was so big for this place  I was pleasantly surprised to find that there were actually  quite a lot of options available at 1:15 PM on a Saturday  about 1hr 15 min until closing. I chose 3 dishes to try: the fruit sando  KFC sando  and bluefin tuna/toro sushi. First off  the price for 5 pieces of the sushi came to nearly $30  and the quality was great. The sushi was SO GOOD; it just melts in your mouth. It also came with homemade soy sauce  pickled ginger  wasabi  and yummy miso soup. My next favorite was the fruit sando. It tasted like a light strawberry cake sandwich. It was very tasty and would go wonderfully with some tea. My least favorite was the KFC sando. I was not at all impressed with this sandwich. There was nothing special about it. I think I would've much more enjoyed an actual KFC sandwich at more than half the price of that way overpriced sandwich (unless they're using the highest and healthiest grade of meat).The total for these three items came to $60. I wouldn't pay that kind of money for sandwiches at this place a second time  but I would return for the sushi. However  I'm glad I finally tried it out  and I did enjoy the experience. Everything came packaged nicely. I loved the little cute and clean touches in preparation and packaging that made the product feel more special."
  },
  {
    "username": "Lisa T.",
    "review": "I came here with a few friends for a quick snack and was not disappointed. We got the egg sando  the matcha and strawberry sando  the strawberry and mango sando  and a 5 piece nigiri set to share between us. The whipped cream on the fruit sandos were really light and not too sweet to compliment the fruit. I'm a huge fan of egg sandos  and this one really hit the spot. The bread was also light and fluffy. The color of the fish was great  and you can really taste the freshness.One thing to note is that they are only open for a few hours around lunch time and have limited seating inside. It's great that everything is packaged to go and easy to pick up.Overall  I really enjoyed my time here and would love to come back when visiting."
  },
  {
    "username": "Bo B.",
    "review": "Came here for lunch. Everything was so fresh and delicious. The futomaki was amazing. We tried two combo sandwich packs. All of the sandwiches were delicious. We got the bulgogi  egg  shrimp tempura  pork katsu  and fish filet."
  }
]